using System;

namespace GameServer
{
	// Token: 0x02000053 RID: 83
	public enum SkillType
	{
		// Token: 0x040002CB RID: 715
		无,
		// Token: 0x040002CC RID: 716
		战士普攻无铭文 = 10300,
		// Token: 0x040002CD RID: 717
		基本剑术无铭文 = 10310,
		// Token: 0x040002CE RID: 718
		基本剑术旋风印,
		// Token: 0x040002CF RID: 719
		基本剑术主宰印,
		// Token: 0x040002D0 RID: 720
		基本剑术幽速印,
		// Token: 0x040002D1 RID: 721
		基本剑术压制印,
		// Token: 0x040002D2 RID: 722
		攻杀主体无铭文 = 14300,
		// Token: 0x040002D3 RID: 723
		攻杀主体暴君印,
		// Token: 0x040002D4 RID: 724
		攻杀主体银光印,
		// Token: 0x040002D5 RID: 725
		攻杀主体血杀印,
		// Token: 0x040002D6 RID: 726
		攻杀主体煌龙印,
		// Token: 0x040002D7 RID: 727
		攻杀剑术无铭文 = 10320,
		// Token: 0x040002D8 RID: 728
		攻杀剑术暴君印,
		// Token: 0x040002D9 RID: 729
		攻杀剑术银光印,
		// Token: 0x040002DA RID: 730
		攻杀剑术血杀印,
		// Token: 0x040002DB RID: 731
		攻杀剑术煌龙印,
		// Token: 0x040002DC RID: 732
		刺杀主体无铭文 = 14310,
		// Token: 0x040002DD RID: 733
		刺杀主体破法印,
		// Token: 0x040002DE RID: 734
		刺杀主体耀光印,
		// Token: 0x040002DF RID: 735
		刺杀主体破山印,
		// Token: 0x040002E0 RID: 736
		刺杀剑术无铭文 = 10330,
		// Token: 0x040002E1 RID: 737
		刺杀剑术破法印,
		// Token: 0x040002E2 RID: 738
		刺杀剑术耀光印,
		// Token: 0x040002E3 RID: 739
		刺杀剑术破山印,
		// Token: 0x040002E4 RID: 740
		半月弯刀无铭文 = 10340,
		// Token: 0x040002E5 RID: 741
		半月弯刀月华印,
		// Token: 0x040002E6 RID: 742
		半月弯刀观月印,
		// Token: 0x040002E7 RID: 743
		半月弯刀疾月印,
		// Token: 0x040002E8 RID: 744
		野蛮冲撞无铭文 = 10350,
		// Token: 0x040002E9 RID: 745
		野蛮冲撞裂风印,
		// Token: 0x040002EA RID: 746
		野蛮冲撞聚火印,
		// Token: 0x040002EB RID: 747
		野蛮冲撞疾步印,
		// Token: 0x040002EC RID: 748
		野蛮冲撞冲撞印,
		// Token: 0x040002ED RID: 749
		野蛮冲撞蛮勇印,
		// Token: 0x040002EE RID: 750
		烈火剑法无铭文 = 10360,
		// Token: 0x040002EF RID: 751
		烈火剑法斩月印,
		// Token: 0x040002F0 RID: 752
		烈火剑法夺火印,
		// Token: 0x040002F1 RID: 753
		烈火剑法燃烧印,
		// Token: 0x040002F2 RID: 754
		狮子吼无铭文 = 10370,
		// Token: 0x040002F3 RID: 755
		狮子吼破甲印,
		// Token: 0x040002F4 RID: 756
		狮子吼凌月印,
		// Token: 0x040002F5 RID: 757
		狮子吼毁伤印,
		// Token: 0x040002F6 RID: 758
		狮子吼梦魇印,
		// Token: 0x040002F7 RID: 759
		狮子吼决意印,
		// Token: 0x040002F8 RID: 760
		狮子吼战吼印,
		// Token: 0x040002F9 RID: 761
		逐日剑法无铭文 = 10380,
		// Token: 0x040002FA RID: 762
		逐日剑法开疆印,
		// Token: 0x040002FB RID: 763
		逐日剑法神躯印,
		// Token: 0x040002FC RID: 764
		逐日剑法升龙印,
		// Token: 0x040002FD RID: 765
		爆炎剑诀无铭文 = 10420,
		// Token: 0x040002FE RID: 766
		爆炎剑诀崩山印,
		// Token: 0x040002FF RID: 767
		爆炎剑诀炎皇印,
		// Token: 0x04000300 RID: 768
		神威盾甲无铭文 = 10460,
		// Token: 0x04000301 RID: 769
		神威盾甲厚甲印,
		// Token: 0x04000302 RID: 770
		神威盾甲长歌印,
		// Token: 0x04000303 RID: 771
		金钟罩无铭文 = 10470,
		// Token: 0x04000304 RID: 772
		金钟罩明王印,
		// Token: 0x04000305 RID: 773
		金钟罩不动印,
		// Token: 0x04000306 RID: 774
		金钟罩忿怒印,
		// Token: 0x04000307 RID: 775
		雷霆剑法无铭文 = 10490,
		// Token: 0x04000308 RID: 776
		雷霆剑法雷泽印,
		// Token: 0x04000309 RID: 777
		雷霆剑法惊雷印,
		// Token: 0x0400030A RID: 778
		雷霆剑法奔雷印,
		// Token: 0x0400030B RID: 779
		法师普攻无铭文 = 25300,
		// Token: 0x0400030C RID: 780
		火球术无铭文 = 25310,
		// Token: 0x0400030D RID: 781
		火球术火锥印,
		// Token: 0x0400030E RID: 782
		抗拒火环无铭文 = 25320,
		// Token: 0x0400030F RID: 783
		抗拒火环焰华印,
		// Token: 0x04000310 RID: 784
		雷电术无铭文 = 25330,
		// Token: 0x04000311 RID: 785
		雷电术天怒印,
		// Token: 0x04000312 RID: 786
		雷电术天罚印,
		// Token: 0x04000313 RID: 787
		火墙无铭文 = 25340,
		// Token: 0x04000314 RID: 788
		火墙观火印,
		// Token: 0x04000315 RID: 789
		火墙真红印,
		// Token: 0x04000316 RID: 790
		魔法盾无铭文 = 25350,
		// Token: 0x04000317 RID: 791
		魔法盾天守印,
		// Token: 0x04000318 RID: 792
		魔法盾霜骨印,
		// Token: 0x04000319 RID: 793
		魔法盾逢生印,
		// Token: 0x0400031A RID: 794
		疾光电影无铭文 = 25360,
		// Token: 0x0400031B RID: 795
		疾光电影雷神印,
		// Token: 0x0400031C RID: 796
		疾光电影雷诛印,
		// Token: 0x0400031D RID: 797
		疾光电影雷咒印,
		// Token: 0x0400031E RID: 798
		冰咆哮无铭文 = 25370,
		// Token: 0x0400031F RID: 799
		冰咆哮龙行印,
		// Token: 0x04000320 RID: 800
		冰咆哮龙魂印,
		// Token: 0x04000321 RID: 801
		瞬息移动无铭文 = 25380,
		// Token: 0x04000322 RID: 802
		瞬息移动空行印,
		// Token: 0x04000323 RID: 803
		灭天火无铭文 = 25390,
		// Token: 0x04000324 RID: 804
		灭天火夺气印,
		// Token: 0x04000325 RID: 805
		灭天火冥火印,
		// Token: 0x04000326 RID: 806
		流星火雨无铭文 = 25400,
		// Token: 0x04000327 RID: 807
		流星火雨火雨印,
		// Token: 0x04000328 RID: 808
		流星火雨陨石印,
		// Token: 0x04000329 RID: 809
		诱惑之光无铭文 = 25410,
		// Token: 0x0400032A RID: 810
		诱惑之光军势印,
		// Token: 0x0400032B RID: 811
		诱惑之光魔语印,
		// Token: 0x0400032C RID: 812
		诱惑之光魔魇印,
		// Token: 0x0400032D RID: 813
		诱惑之光血契印,
		// Token: 0x0400032E RID: 814
		诱惑之光噬魂印,
		// Token: 0x0400032F RID: 815
		诱惑之光邪光印,
		// Token: 0x04000330 RID: 816
		诱惑之光邪影印,
		// Token: 0x04000331 RID: 817
		地狱火无铭文 = 25440,
		// Token: 0x04000332 RID: 818
		地狱火炎龙印,
		// Token: 0x04000333 RID: 819
		爆裂火焰无铭文 = 25450,
		// Token: 0x04000334 RID: 820
		爆裂火焰疾火印,
		// Token: 0x04000335 RID: 821
		地狱雷光无铭文 = 25460,
		// Token: 0x04000336 RID: 822
		地狱雷光雷龙印,
		// Token: 0x04000337 RID: 823
		圣言术无铭文 = 25470,
		// Token: 0x04000338 RID: 824
		圣言术阳炎印,
		// Token: 0x04000339 RID: 825
		圣言术圣灵印,
		// Token: 0x0400033A RID: 826
		圣言术秘咒印,
		// Token: 0x0400033B RID: 827
		大火球无铭文 = 25490,
		// Token: 0x0400033C RID: 828
		大火球连环印,
		// Token: 0x0400033D RID: 829
		寒冰掌无铭文 = 25500,
		// Token: 0x0400033E RID: 830
		寒冰掌霜冻印,
		// Token: 0x0400033F RID: 831
		雷霆万击无铭文 = 25520,
		// Token: 0x04000340 RID: 832
		魔陨星沉无铭文 = 25530,
		// Token: 0x04000341 RID: 833
		魔能闪无铭文 = 25540,
		// Token: 0x04000342 RID: 834
		魔能闪魔威印,
		// Token: 0x04000343 RID: 835
		魔能闪唤魔印,
		// Token: 0x04000344 RID: 836
		法神奥义无铭文 = 25570,
		// Token: 0x04000345 RID: 837
		法神奥义魔魂印,
		// Token: 0x04000346 RID: 838
		法神奥义血魂印,
		// Token: 0x04000347 RID: 839
		法神奥义燃魂印,
		// Token: 0x04000348 RID: 840
		元素星辰无铭文 = 25580,
		// Token: 0x04000349 RID: 841
		元素星辰焚薪印,
		// Token: 0x0400034A RID: 842
		元素星辰雷劫印,
		// Token: 0x0400034B RID: 843
		元素星辰霜恸印,
		// Token: 0x0400034C RID: 844
		道士普攻无铭文 = 30000,
		// Token: 0x0400034D RID: 845
		精神力战法无铭文 = 30010,
		// Token: 0x0400034E RID: 846
		精神力战法灵爆印,
		// Token: 0x0400034F RID: 847
		精神力战法灵击印,
		// Token: 0x04000350 RID: 848
		精神力战法道法印,
		// Token: 0x04000351 RID: 849
		治愈术无铭文 = 30020,
		// Token: 0x04000352 RID: 850
		治愈术神佑印,
		// Token: 0x04000353 RID: 851
		治愈术妙手印,
		// Token: 0x04000354 RID: 852
		召唤骷髅无铭文 = 30030,
		// Token: 0x04000355 RID: 853
		召唤骷髅君王印,
		// Token: 0x04000356 RID: 854
		召唤骷髅迦兰印,
		// Token: 0x04000357 RID: 855
		召唤骷髅偷天印,
		// Token: 0x04000358 RID: 856
		施毒术无铭文 = 30040,
		// Token: 0x04000359 RID: 857
		施毒术凌波印,
		// Token: 0x0400035A RID: 858
		施毒术凌锋印,
		// Token: 0x0400035B RID: 859
		施毒术凌云印,
		// Token: 0x0400035C RID: 860
		施毒术凌御印,
		// Token: 0x0400035D RID: 861
		施毒术凌蛊印,
		// Token: 0x0400035E RID: 862
		灵魂火符无铭文 = 30050,
		// Token: 0x0400035F RID: 863
		灵魂火符符阵印,
		// Token: 0x04000360 RID: 864
		灵魂火符灵控印,
		// Token: 0x04000361 RID: 865
		灵魂火符火蛇印,
		// Token: 0x04000362 RID: 866
		灵魂火符弹射印,
		// Token: 0x04000363 RID: 867
		幽灵盾无铭文 = 30060,
		// Token: 0x04000364 RID: 868
		幽灵盾驱毒印,
		// Token: 0x04000365 RID: 869
		幽灵盾吉兆印,
		// Token: 0x04000366 RID: 870
		幽灵盾灵携印,
		// Token: 0x04000367 RID: 871
		幽灵盾玄极印,
		// Token: 0x04000368 RID: 872
		神圣战甲术无铭文 = 30070,
		// Token: 0x04000369 RID: 873
		神圣战甲术凝丹印,
		// Token: 0x0400036A RID: 874
		神圣战甲术白虎印,
		// Token: 0x0400036B RID: 875
		神圣战甲术朱雀印,
		// Token: 0x0400036C RID: 876
		神圣战甲术无极印,
		// Token: 0x0400036D RID: 877
		召唤神兽无铭文 = 30080,
		// Token: 0x0400036E RID: 878
		召唤神兽圣兽印,
		// Token: 0x0400036F RID: 879
		召唤神兽血兽印,
		// Token: 0x04000370 RID: 880
		召唤神兽灵兽印,
		// Token: 0x04000371 RID: 881
		隐身术无铭文 = 30090,
		// Token: 0x04000372 RID: 882
		隐身术空相印,
		// Token: 0x04000373 RID: 883
		噬血术无铭文 = 30100,
		// Token: 0x04000374 RID: 884
		噬血术噬心印,
		// Token: 0x04000375 RID: 885
		噬血术夺魂印,
		// Token: 0x04000376 RID: 886
		噬血术失魂印,
		// Token: 0x04000377 RID: 887
		困魔咒无铭文 = 30110,
		// Token: 0x04000378 RID: 888
		困魔咒邪咒印,
		// Token: 0x04000379 RID: 889
		群体治愈术无铭文 = 30120,
		// Token: 0x0400037A RID: 890
		群体治愈术瑶光印,
		// Token: 0x0400037B RID: 891
		集体隐身术无铭文 = 30140,
		// Token: 0x0400037C RID: 892
		集体隐身术太极印,
		// Token: 0x0400037D RID: 893
		无极真气无铭文 = 30150,
		// Token: 0x0400037E RID: 894
		无极真气天罡印,
		// Token: 0x0400037F RID: 895
		无极真气纯阳印,
		// Token: 0x04000380 RID: 896
		气功波无铭文 = 30180,
		// Token: 0x04000381 RID: 897
		气功波气场印,
		// Token: 0x04000382 RID: 898
		气功波浩然印,
		// Token: 0x04000383 RID: 899
		道尊天喻无铭文 = 30220,
		// Token: 0x04000384 RID: 900
		道尊天喻通灵印,
		// Token: 0x04000385 RID: 901
		道尊天喻通天印,
		// Token: 0x04000386 RID: 902
		召唤月灵无铭文 = 30240,
		// Token: 0x04000387 RID: 903
		召唤月灵幻灵印,
		// Token: 0x04000388 RID: 904
		召唤月灵月魔印,
		// Token: 0x04000389 RID: 905
		召唤月灵月神印,
		// Token: 0x0400038A RID: 906
		阴阳道盾无铭文 = 30250,
		// Token: 0x0400038B RID: 907
		阴阳道盾混元印,
		// Token: 0x0400038C RID: 908
		阴阳道盾重光印,
		// Token: 0x0400038D RID: 909
		阴阳道盾紫渊印,
		// Token: 0x0400038E RID: 910
		刺客普攻无铭文 = 15300,
		// Token: 0x0400038F RID: 911
		暴击术无铭文 = 15310,
		// Token: 0x04000390 RID: 912
		暴击术斩杀印,
		// Token: 0x04000391 RID: 913
		暴击术残像印,
		// Token: 0x04000392 RID: 914
		暴击术鹰眼印,
		// Token: 0x04000393 RID: 915
		暴击术狩猎印,
		// Token: 0x04000394 RID: 916
		潜行术无铭文 = 15320,
		// Token: 0x04000395 RID: 917
		潜行术隐遁印,
		// Token: 0x04000396 RID: 918
		潜行术血隐印,
		// Token: 0x04000397 RID: 919
		潜行术无竭印,
		// Token: 0x04000398 RID: 920
		致残毒药无铭文 = 15330,
		// Token: 0x04000399 RID: 921
		致残毒药鹰目印,
		// Token: 0x0400039A RID: 922
		致残毒药心妒印,
		// Token: 0x0400039B RID: 923
		致残毒药制约印,
		// Token: 0x0400039C RID: 924
		致残毒药血煞印,
		// Token: 0x0400039D RID: 925
		致残毒药星裂印,
		// Token: 0x0400039E RID: 926
		精准术无铭文 = 15340,
		// Token: 0x0400039F RID: 927
		精准术审判印,
		// Token: 0x040003A0 RID: 928
		精准术混沌印,
		// Token: 0x040003A1 RID: 929
		精准术续战印,
		// Token: 0x040003A2 RID: 930
		精准术乱影印,
		// Token: 0x040003A3 RID: 931
		炎龙波无铭文 = 15350,
		// Token: 0x040003A4 RID: 932
		炎龙波游龙印,
		// Token: 0x040003A5 RID: 933
		炎龙波龙霄印,
		// Token: 0x040003A6 RID: 934
		炎龙波灼龙印,
		// Token: 0x040003A7 RID: 935
		炎龙波执著印,
		// Token: 0x040003A8 RID: 936
		旋风腿无铭文 = 15360,
		// Token: 0x040003A9 RID: 937
		旋风腿朔风印,
		// Token: 0x040003AA RID: 938
		旋风腿龙摆印,
		// Token: 0x040003AB RID: 939
		旋风腿缚魂印,
		// Token: 0x040003AC RID: 940
		鬼灵步无铭文 = 15370,
		// Token: 0x040003AD RID: 941
		鬼灵步传灾印,
		// Token: 0x040003AE RID: 942
		鬼灵步移形印,
		// Token: 0x040003AF RID: 943
		鬼灵步脱兔印,
		// Token: 0x040003B0 RID: 944
		鬼灵步火径印,
		// Token: 0x040003B1 RID: 945
		冷酷无铭文 = 15380,
		// Token: 0x040003B2 RID: 946
		冷酷灵光印,
		// Token: 0x040003B3 RID: 947
		冷酷残步印,
		// Token: 0x040003B4 RID: 948
		火镰狂舞无铭文 = 15390,
		// Token: 0x040003B5 RID: 949
		火镰狂舞双斩印,
		// Token: 0x040003B6 RID: 950
		火镰狂舞火舞印,
		// Token: 0x040003B7 RID: 951
		追魂镖无铭文 = 15410,
		// Token: 0x040003B8 RID: 952
		追魂镖索魂印,
		// Token: 0x040003B9 RID: 953
		追魂镖延染印,
		// Token: 0x040003BA RID: 954
		霹雳弹无铭文 = 15420,
		// Token: 0x040003BB RID: 955
		霹雳弹窒息印,
		// Token: 0x040003BC RID: 956
		霹雳弹腐蚀印,
		// Token: 0x040003BD RID: 957
		霹雳弹迟滞印,
		// Token: 0x040003BE RID: 958
		献祭无铭文 = 15450,
		// Token: 0x040003BF RID: 959
		献祭吮血印,
		// Token: 0x040003C0 RID: 960
		献祭噬骨印,
		// Token: 0x040003C1 RID: 961
		暗影守卫无铭文 = 15460,
		// Token: 0x040003C2 RID: 962
		暗影守卫殇影印,
		// Token: 0x040003C3 RID: 963
		暗影守卫铁卫印,
		// Token: 0x040003C4 RID: 964
		暗影守卫暗魔印,
		// Token: 0x040003C5 RID: 965
		魔刃天旋无铭文 = 15470,
		// Token: 0x040003C6 RID: 966
		魔刃天旋软猬印,
		// Token: 0x040003C7 RID: 967
		魔刃天旋刃甲印,
		// Token: 0x040003C8 RID: 968
		魔刃天旋裂伤印,
		// Token: 0x040003C9 RID: 969
		弓手普攻无铭文 = 20400,
		// Token: 0x040003CA RID: 970
		基础射击无铭文 = 20410,
		// Token: 0x040003CB RID: 971
		基础射击伏虎印,
		// Token: 0x040003CC RID: 972
		基础射击清心印,
		// Token: 0x040003CD RID: 973
		精准打击无铭文 = 20420,
		// Token: 0x040003CE RID: 974
		精准打击透骨印,
		// Token: 0x040003CF RID: 975
		精准打击射戟印,
		// Token: 0x040003D0 RID: 976
		精准打击飞蝗印,
		// Token: 0x040003D1 RID: 977
		二连射无铭文 = 20430,
		// Token: 0x040003D2 RID: 978
		二连射冰羽印,
		// Token: 0x040003D3 RID: 979
		二连射驱魔印,
		// Token: 0x040003D4 RID: 980
		二连射双刑印,
		// Token: 0x040003D5 RID: 981
		战术标记无铭文 = 20440,
		// Token: 0x040003D6 RID: 982
		战术标记铁索印,
		// Token: 0x040003D7 RID: 983
		战术标记汲灵印,
		// Token: 0x040003D8 RID: 984
		战术标记失神印,
		// Token: 0x040003D9 RID: 985
		三发散射无铭文 = 20450,
		// Token: 0x040003DA RID: 986
		三发散射四泾印,
		// Token: 0x040003DB RID: 987
		三发散射三刻印,
		// Token: 0x040003DC RID: 988
		击飞射击无铭文 = 20460,
		// Token: 0x040003DD RID: 989
		击飞射击惩击印,
		// Token: 0x040003DE RID: 990
		击飞射击风缚印,
		// Token: 0x040003DF RID: 991
		击飞射击穿杨印,
		// Token: 0x040003E0 RID: 992
		连环暗雷无铭文 = 20470,
		// Token: 0x040003E1 RID: 993
		连环暗雷冰霜印,
		// Token: 0x040003E2 RID: 994
		连环暗雷旋刃印,
		// Token: 0x040003E3 RID: 995
		强袭无铭文 = 20480,
		// Token: 0x040003E4 RID: 996
		强袭爆裂印,
		// Token: 0x040003E5 RID: 997
		强袭煞血印,
		// Token: 0x040003E6 RID: 998
		强袭破灵印,
		// Token: 0x040003E7 RID: 999
		强袭空灵印,
		// Token: 0x040003E8 RID: 1000
		羿神庇佑无铭文 = 20490,
		// Token: 0x040003E9 RID: 1001
		羿神庇佑御风印,
		// Token: 0x040003EA RID: 1002
		羿神庇佑神恩印,
		// Token: 0x040003EB RID: 1003
		羿神庇佑捷风印,
		// Token: 0x040003EC RID: 1004
		穿刺射击无铭文 = 20500,
		// Token: 0x040003ED RID: 1005
		穿刺射击赤火印,
		// Token: 0x040003EE RID: 1006
		穿刺射击震穹印,
		// Token: 0x040003EF RID: 1007
		凝神无铭文 = 20510,
		// Token: 0x040003F0 RID: 1008
		凝神狩心印,
		// Token: 0x040003F1 RID: 1009
		凝神凝魂印,
		// Token: 0x040003F2 RID: 1010
		凝神神启印,
		// Token: 0x040003F3 RID: 1011
		守护箭羽无铭文 = 20520,
		// Token: 0x040003F4 RID: 1012
		守护箭羽鸿铠印,
		// Token: 0x040003F5 RID: 1013
		守护箭羽震铠印,
		// Token: 0x040003F6 RID: 1014
		万箭齐发无铭文 = 20530,
		// Token: 0x040003F7 RID: 1015
		火凤燎原无铭文 = 20540,
		// Token: 0x040003F8 RID: 1016
		回避射击无铭文 = 20560,
		// Token: 0x040003F9 RID: 1017
		回避射击闪灵印,
		// Token: 0x040003FA RID: 1018
		回避射击明心印,
		// Token: 0x040003FB RID: 1019
		回避射击回风印,
		// Token: 0x040003FC RID: 1020
		万箭穿心无铭文 = 20570,
		// Token: 0x040003FD RID: 1021
		万箭穿心幻羽印,
		// Token: 0x040003FE RID: 1022
		万箭穿心积威印,
		// Token: 0x040003FF RID: 1023
		万箭穿心无隙印,
		// Token: 0x04000400 RID: 1024
		龙枪普攻无铭文 = 12000,
		// Token: 0x04000401 RID: 1025
		中平枪术无铭文 = 12010,
		// Token: 0x04000402 RID: 1026
		中平枪术霸王印,
		// Token: 0x04000403 RID: 1027
		中平枪术钢握印,
		// Token: 0x04000404 RID: 1028
		伏波荡寇无铭文 = 12020,
		// Token: 0x04000405 RID: 1029
		伏波荡寇泽国印,
		// Token: 0x04000406 RID: 1030
		伏波荡寇定军印,
		// Token: 0x04000407 RID: 1031
		横扫六合无铭文 = 12030,
		// Token: 0x04000408 RID: 1032
		横扫六合战痕印,
		// Token: 0x04000409 RID: 1033
		横扫六合裂甲印,
		// Token: 0x0400040A RID: 1034
		狂飙突刺无铭文 = 12040,
		// Token: 0x0400040B RID: 1035
		狂飙突刺积雷印,
		// Token: 0x0400040C RID: 1036
		狂飙突刺缠杀印,
		// Token: 0x0400040D RID: 1037
		狂飙突刺白衣印,
		// Token: 0x0400040E RID: 1038
		钩镰枪法无铭文 = 12050,
		// Token: 0x0400040F RID: 1039
		钩镰枪法狮牙印,
		// Token: 0x04000410 RID: 1040
		钩镰枪法蛇吻印,
		// Token: 0x04000411 RID: 1041
		钩镰枪法虎爪印,
		// Token: 0x04000412 RID: 1042
		钩镰枪法血蝠印,
		// Token: 0x04000413 RID: 1043
		乾坤斗气无铭文 = 12060,
		// Token: 0x04000414 RID: 1044
		乾坤斗气龙鳞印,
		// Token: 0x04000415 RID: 1045
		乾坤斗气龙威印,
		// Token: 0x04000416 RID: 1046
		神威镇域无铭文 = 12070,
		// Token: 0x04000417 RID: 1047
		神威镇域据守印,
		// Token: 0x04000418 RID: 1048
		神威镇域断喝印,
		// Token: 0x04000419 RID: 1049
		枪出如龙无铭文 = 12080,
		// Token: 0x0400041A RID: 1050
		枪出如龙焚城印,
		// Token: 0x0400041B RID: 1051
		枪出如龙斩将印,
		// Token: 0x0400041C RID: 1052
		枪出如龙雷殛印,
		// Token: 0x0400041D RID: 1053
		御龙晶甲无铭文 = 12090,
		// Token: 0x0400041E RID: 1054
		御龙晶甲长磐印,
		// Token: 0x0400041F RID: 1055
		御龙晶甲龙胆印,
		// Token: 0x04000420 RID: 1056
		御龙晶甲吞虎印,
		// Token: 0x04000421 RID: 1057
		凌云枪法无铭文 = 12100,
		// Token: 0x04000422 RID: 1058
		凌云枪法撼地印,
		// Token: 0x04000423 RID: 1059
		凌云枪法乱阵印,
		// Token: 0x04000424 RID: 1060
		燃血化元无铭文 = 12110,
		// Token: 0x04000425 RID: 1061
		燃血化元龙元印,
		// Token: 0x04000426 RID: 1062
		燃血化元传薪印,
		// Token: 0x04000427 RID: 1063
		燃血化元无双印,
		// Token: 0x04000428 RID: 1064
		召唤龙驹无铭文 = 12120,
		// Token: 0x04000429 RID: 1065
		召唤龙驹破军印,
		// Token: 0x0400042A RID: 1066
		召唤龙驹救主印,
		// Token: 0x0400042B RID: 1067
		盘龙枪势无铭文 = 12130,
		// Token: 0x0400042C RID: 1068
		盘龙枪势金甲印,
		// Token: 0x0400042D RID: 1069
		盘龙枪势虎痴印,
		// Token: 0x0400042E RID: 1070
		盘龙枪势辟邪印,
		// Token: 0x0400042F RID: 1071
		百战军魂无铭文 = 12140,
		// Token: 0x04000430 RID: 1072
		百战军魂鏖战印,
		// Token: 0x04000431 RID: 1073
		百战军魂血爆印,
		// Token: 0x04000432 RID: 1074
		百战军魂千军印
	}
}
