using System;

namespace GameServer
{
	
	public enum GameObjectProperties
	{
		
		未知属性,
		
		最小防御 = 2,
		
		最大防御,
		
		最小魔防,
		
		最大魔防,
		
		最小攻击,
		
		最大攻击,
		
		最小魔法,
		
		最大魔法,
		
		最小道术,
		
		最大道术,
		
		最小刺术,
		
		最大刺术,
		
		最小弓术,
		
		最大弓术,
		
		最大体力,
		
		最大魔力,
		
		行走速度,
		
		奔跑速度,
		
		物理准确,
		
		物理敏捷,
		
		魔法闪避,
		
		暴击概率,
		
		暴击伤害,
		
		药品回血 = 29,
		
		药品回魔,
		
		幸运等级,
		
		攻击速度 = 36,
		
		体力恢复,
		
		魔力恢复,
		
		中毒躲避 = 45,
		
		最大腕力 = 50,
		
		最大穿戴,
		
		最大负重,
		
		技能标志 = 56,
		
		攻杀标志,
		
		最小圣伤 = 67,
		
		最大圣伤,
		
		怪物伤害 = 112,
		
		怪物闪避,
		
		怪物破防,
		
		怪物命中
	}
}
