using System;

namespace GameServer
{
	
	public enum ObjectHairType
	{
		
		战士男00 = 256,
		
		战士男01,
		
		战士男02,
		
		战士男03,
		
		战士男04,
		
		战士男05,
		
		战士男06,
		
		战士男07,
		
		战士男08,
		
		战士男09,
		
		战士男10,
		
		战士男11,
		
		战士女00 = 512,
		
		战士女01,
		
		战士女02,
		
		战士女03,
		
		战士女04,
		
		战士女05,
		
		战士女06,
		
		战士女07,
		
		战士女08,
		
		战士女09,
		
		战士女10,
		
		战士女11,
		
		法师男00 = 65792,
		
		法师男01,
		
		法师男02,
		
		法师男03,
		
		法师男04,
		
		法师男05,
		
		法师男06,
		
		法师男07,
		
		法师男08,
		
		法师男09,
		
		法师男10,
		
		法师男11,
		
		法师女00 = 66048,
		
		法师女01,
		
		法师女02,
		
		法师女03,
		
		法师女04,
		
		法师女05,
		
		法师女06,
		
		法师女07,
		
		法师女08,
		
		法师女09,
		
		法师女10,
		
		法师女11,
		
		道士男00 = 262400,
		
		道士男01,
		
		道士男02,
		
		道士男03,
		
		道士男04,
		
		道士男05,
		
		道士男06,
		
		道士男07,
		
		道士男08,
		
		道士男09,
		
		道士男10,
		
		道士男11,
		
		道士女00 = 262656,
		
		道士女01,
		
		道士女02,
		
		道士女03,
		
		道士女04,
		
		道士女05,
		
		道士女06,
		
		道士女07,
		
		道士女08,
		
		道士女09,
		
		道士女10,
		
		道士女11,
		
		刺客男00 = 131328,
		
		刺客男01,
		
		刺客男02,
		
		刺客男03,
		
		刺客男04,
		
		刺客男05,
		
		刺客男06,
		
		刺客男07,
		
		刺客男08,
		
		刺客男09,
		
		刺客女00 = 131584,
		
		刺客女01,
		
		刺客女02,
		
		刺客女03,
		
		刺客女04,
		
		刺客女05,
		
		刺客女06,
		
		刺客女07,
		
		刺客女08,
		
		刺客女09,
		
		刺客女10,
		
		刺客女11,
		
		弓手男00 = 196864,
		
		弓手男01,
		
		弓手男02,
		
		弓手男03,
		
		弓手男04,
		
		弓手男05,
		
		弓手男06,
		
		弓手男07,
		
		弓手男08,
		
		弓手男09,
		
		弓手男10,
		
		弓手男11,
		
		弓手女00 = 197120,
		
		弓手女01,
		
		弓手女02,
		
		弓手女03,
		
		弓手女04,
		
		弓手女05,
		
		弓手女06,
		
		弓手女07,
		
		弓手女08,
		
		弓手女09,
		
		弓手女10,
		
		弓手女11,
		
		龙枪男00 = 327936,
		
		龙枪男01,
		
		龙枪男02,
		
		龙枪男03,
		
		龙枪男04,
		
		龙枪男05,
		
		龙枪男06,
		
		龙枪男07,
		
		龙枪女00 = 328192,
		
		龙枪女01,
		
		龙枪女02,
		
		龙枪女03,
		
		龙枪女04,
		
		龙枪女05,
		
		龙枪女06,
		
		龙枪女07
	}
}
