using System;

namespace GameServer
{
	
	public enum SkillType
	{
		
		无,
		
		战士普攻无铭文 = 10300,
		
		基本剑术无铭文 = 10310,
		
		基本剑术旋风印,
		
		基本剑术主宰印,
		
		基本剑术幽速印,
		
		基本剑术压制印,
		
		攻杀主体无铭文 = 14300,
		
		攻杀主体暴君印,
		
		攻杀主体银光印,
		
		攻杀主体血杀印,
		
		攻杀主体煌龙印,
		
		攻杀剑术无铭文 = 10320,
		
		攻杀剑术暴君印,
		
		攻杀剑术银光印,
		
		攻杀剑术血杀印,
		
		攻杀剑术煌龙印,
		
		刺杀主体无铭文 = 14310,
		
		刺杀主体破法印,
		
		刺杀主体耀光印,
		
		刺杀主体破山印,
		
		刺杀剑术无铭文 = 10330,
		
		刺杀剑术破法印,
		
		刺杀剑术耀光印,
		
		刺杀剑术破山印,
		
		半月弯刀无铭文 = 10340,
		
		半月弯刀月华印,
		
		半月弯刀观月印,
		
		半月弯刀疾月印,
		
		野蛮冲撞无铭文 = 10350,
		
		野蛮冲撞裂风印,
		
		野蛮冲撞聚火印,
		
		野蛮冲撞疾步印,
		
		野蛮冲撞冲撞印,
		
		野蛮冲撞蛮勇印,
		
		烈火剑法无铭文 = 10360,
		
		烈火剑法斩月印,
		
		烈火剑法夺火印,
		
		烈火剑法燃烧印,
		
		狮子吼无铭文 = 10370,
		
		狮子吼破甲印,
		
		狮子吼凌月印,
		
		狮子吼毁伤印,
		
		狮子吼梦魇印,
		
		狮子吼决意印,
		
		狮子吼战吼印,
		
		逐日剑法无铭文 = 10380,
		
		逐日剑法开疆印,
		
		逐日剑法神躯印,
		
		逐日剑法升龙印,
		
		爆炎剑诀无铭文 = 10420,
		
		爆炎剑诀崩山印,
		
		爆炎剑诀炎皇印,
		
		神威盾甲无铭文 = 10460,
		
		神威盾甲厚甲印,
		
		神威盾甲长歌印,
		
		金钟罩无铭文 = 10470,
		
		金钟罩明王印,
		
		金钟罩不动印,
		
		金钟罩忿怒印,
		
		雷霆剑法无铭文 = 10490,
		
		雷霆剑法雷泽印,
		
		雷霆剑法惊雷印,
		
		雷霆剑法奔雷印,
		
		法师普攻无铭文 = 25300,
		
		火球术无铭文 = 25310,
		
		火球术火锥印,
		
		抗拒火环无铭文 = 25320,
		
		抗拒火环焰华印,
		
		雷电术无铭文 = 25330,
		
		雷电术天怒印,
		
		雷电术天罚印,
		
		火墙无铭文 = 25340,
		
		火墙观火印,
		
		火墙真红印,
		
		魔法盾无铭文 = 25350,
		
		魔法盾天守印,
		
		魔法盾霜骨印,
		
		魔法盾逢生印,
		
		疾光电影无铭文 = 25360,
		
		疾光电影雷神印,
		
		疾光电影雷诛印,
		
		疾光电影雷咒印,
		
		冰咆哮无铭文 = 25370,
		
		冰咆哮龙行印,
		
		冰咆哮龙魂印,
		
		瞬息移动无铭文 = 25380,
		
		瞬息移动空行印,
		
		灭天火无铭文 = 25390,
		
		灭天火夺气印,
		
		灭天火冥火印,
		
		流星火雨无铭文 = 25400,
		
		流星火雨火雨印,
		
		流星火雨陨石印,
		
		诱惑之光无铭文 = 25410,
		
		诱惑之光军势印,
		
		诱惑之光魔语印,
		
		诱惑之光魔魇印,
		
		诱惑之光血契印,
		
		诱惑之光噬魂印,
		
		诱惑之光邪光印,
		
		诱惑之光邪影印,
		
		地狱火无铭文 = 25440,
		
		地狱火炎龙印,
		
		爆裂火焰无铭文 = 25450,
		
		爆裂火焰疾火印,
		
		地狱雷光无铭文 = 25460,
		
		地狱雷光雷龙印,
		
		圣言术无铭文 = 25470,
		
		圣言术阳炎印,
		
		圣言术圣灵印,
		
		圣言术秘咒印,
		
		大火球无铭文 = 25490,
		
		大火球连环印,
		
		寒冰掌无铭文 = 25500,
		
		寒冰掌霜冻印,
		
		雷霆万击无铭文 = 25520,
		
		魔陨星沉无铭文 = 25530,
		
		魔能闪无铭文 = 25540,
		
		魔能闪魔威印,
		
		魔能闪唤魔印,
		
		法神奥义无铭文 = 25570,
		
		法神奥义魔魂印,
		
		法神奥义血魂印,
		
		法神奥义燃魂印,
		
		元素星辰无铭文 = 25580,
		
		元素星辰焚薪印,
		
		元素星辰雷劫印,
		
		元素星辰霜恸印,
		
		道士普攻无铭文 = 30000,
		
		精神力战法无铭文 = 30010,
		
		精神力战法灵爆印,
		
		精神力战法灵击印,
		
		精神力战法道法印,
		
		治愈术无铭文 = 30020,
		
		治愈术神佑印,
		
		治愈术妙手印,
		
		召唤骷髅无铭文 = 30030,
		
		召唤骷髅君王印,
		
		召唤骷髅迦兰印,
		
		召唤骷髅偷天印,
		
		施毒术无铭文 = 30040,
		
		施毒术凌波印,
		
		施毒术凌锋印,
		
		施毒术凌云印,
		
		施毒术凌御印,
		
		施毒术凌蛊印,
		
		灵魂火符无铭文 = 30050,
		
		灵魂火符符阵印,
		
		灵魂火符灵控印,
		
		灵魂火符火蛇印,
		
		灵魂火符弹射印,
		
		幽灵盾无铭文 = 30060,
		
		幽灵盾驱毒印,
		
		幽灵盾吉兆印,
		
		幽灵盾灵携印,
		
		幽灵盾玄极印,
		
		神圣战甲术无铭文 = 30070,
		
		神圣战甲术凝丹印,
		
		神圣战甲术白虎印,
		
		神圣战甲术朱雀印,
		
		神圣战甲术无极印,
		
		召唤神兽无铭文 = 30080,
		
		召唤神兽圣兽印,
		
		召唤神兽血兽印,
		
		召唤神兽灵兽印,
		
		隐身术无铭文 = 30090,
		
		隐身术空相印,
		
		噬血术无铭文 = 30100,
		
		噬血术噬心印,
		
		噬血术夺魂印,
		
		噬血术失魂印,
		
		困魔咒无铭文 = 30110,
		
		困魔咒邪咒印,
		
		群体治愈术无铭文 = 30120,
		
		群体治愈术瑶光印,
		
		集体隐身术无铭文 = 30140,
		
		集体隐身术太极印,
		
		无极真气无铭文 = 30150,
		
		无极真气天罡印,
		
		无极真气纯阳印,
		
		气功波无铭文 = 30180,
		
		气功波气场印,
		
		气功波浩然印,
		
		道尊天喻无铭文 = 30220,
		
		道尊天喻通灵印,
		
		道尊天喻通天印,
		
		召唤月灵无铭文 = 30240,
		
		召唤月灵幻灵印,
		
		召唤月灵月魔印,
		
		召唤月灵月神印,
		
		阴阳道盾无铭文 = 30250,
		
		阴阳道盾混元印,
		
		阴阳道盾重光印,
		
		阴阳道盾紫渊印,
		
		刺客普攻无铭文 = 15300,
		
		暴击术无铭文 = 15310,
		
		暴击术斩杀印,
		
		暴击术残像印,
		
		暴击术鹰眼印,
		
		暴击术狩猎印,
		
		潜行术无铭文 = 15320,
		
		潜行术隐遁印,
		
		潜行术血隐印,
		
		潜行术无竭印,
		
		致残毒药无铭文 = 15330,
		
		致残毒药鹰目印,
		
		致残毒药心妒印,
		
		致残毒药制约印,
		
		致残毒药血煞印,
		
		致残毒药星裂印,
		
		精准术无铭文 = 15340,
		
		精准术审判印,
		
		精准术混沌印,
		
		精准术续战印,
		
		精准术乱影印,
		
		炎龙波无铭文 = 15350,
		
		炎龙波游龙印,
		
		炎龙波龙霄印,
		
		炎龙波灼龙印,
		
		炎龙波执著印,
		
		旋风腿无铭文 = 15360,
		
		旋风腿朔风印,
		
		旋风腿龙摆印,
		
		旋风腿缚魂印,
		
		鬼灵步无铭文 = 15370,
		
		鬼灵步传灾印,
		
		鬼灵步移形印,
		
		鬼灵步脱兔印,
		
		鬼灵步火径印,
		
		冷酷无铭文 = 15380,
		
		冷酷灵光印,
		
		冷酷残步印,
		
		火镰狂舞无铭文 = 15390,
		
		火镰狂舞双斩印,
		
		火镰狂舞火舞印,
		
		追魂镖无铭文 = 15410,
		
		追魂镖索魂印,
		
		追魂镖延染印,
		
		霹雳弹无铭文 = 15420,
		
		霹雳弹窒息印,
		
		霹雳弹腐蚀印,
		
		霹雳弹迟滞印,
		
		献祭无铭文 = 15450,
		
		献祭吮血印,
		
		献祭噬骨印,
		
		暗影守卫无铭文 = 15460,
		
		暗影守卫殇影印,
		
		暗影守卫铁卫印,
		
		暗影守卫暗魔印,
		
		魔刃天旋无铭文 = 15470,
		
		魔刃天旋软猬印,
		
		魔刃天旋刃甲印,
		
		魔刃天旋裂伤印,
		
		弓手普攻无铭文 = 20400,
		
		基础射击无铭文 = 20410,
		
		基础射击伏虎印,
		
		基础射击清心印,
		
		精准打击无铭文 = 20420,
		
		精准打击透骨印,
		
		精准打击射戟印,
		
		精准打击飞蝗印,
		
		二连射无铭文 = 20430,
		
		二连射冰羽印,
		
		二连射驱魔印,
		
		二连射双刑印,
		
		战术标记无铭文 = 20440,
		
		战术标记铁索印,
		
		战术标记汲灵印,
		
		战术标记失神印,
		
		三发散射无铭文 = 20450,
		
		三发散射四泾印,
		
		三发散射三刻印,
		
		击飞射击无铭文 = 20460,
		
		击飞射击惩击印,
		
		击飞射击风缚印,
		
		击飞射击穿杨印,
		
		连环暗雷无铭文 = 20470,
		
		连环暗雷冰霜印,
		
		连环暗雷旋刃印,
		
		强袭无铭文 = 20480,
		
		强袭爆裂印,
		
		强袭煞血印,
		
		强袭破灵印,
		
		强袭空灵印,
		
		羿神庇佑无铭文 = 20490,
		
		羿神庇佑御风印,
		
		羿神庇佑神恩印,
		
		羿神庇佑捷风印,
		
		穿刺射击无铭文 = 20500,
		
		穿刺射击赤火印,
		
		穿刺射击震穹印,
		
		凝神无铭文 = 20510,
		
		凝神狩心印,
		
		凝神凝魂印,
		
		凝神神启印,
		
		守护箭羽无铭文 = 20520,
		
		守护箭羽鸿铠印,
		
		守护箭羽震铠印,
		
		万箭齐发无铭文 = 20530,
		
		火凤燎原无铭文 = 20540,
		
		回避射击无铭文 = 20560,
		
		回避射击闪灵印,
		
		回避射击明心印,
		
		回避射击回风印,
		
		万箭穿心无铭文 = 20570,
		
		万箭穿心幻羽印,
		
		万箭穿心积威印,
		
		万箭穿心无隙印,
		
		龙枪普攻无铭文 = 12000,
		
		中平枪术无铭文 = 12010,
		
		中平枪术霸王印,
		
		中平枪术钢握印,
		
		伏波荡寇无铭文 = 12020,
		
		伏波荡寇泽国印,
		
		伏波荡寇定军印,
		
		横扫六合无铭文 = 12030,
		
		横扫六合战痕印,
		
		横扫六合裂甲印,
		
		狂飙突刺无铭文 = 12040,
		
		狂飙突刺积雷印,
		
		狂飙突刺缠杀印,
		
		狂飙突刺白衣印,
		
		钩镰枪法无铭文 = 12050,
		
		钩镰枪法狮牙印,
		
		钩镰枪法蛇吻印,
		
		钩镰枪法虎爪印,
		
		钩镰枪法血蝠印,
		
		乾坤斗气无铭文 = 12060,
		
		乾坤斗气龙鳞印,
		
		乾坤斗气龙威印,
		
		神威镇域无铭文 = 12070,
		
		神威镇域据守印,
		
		神威镇域断喝印,
		
		枪出如龙无铭文 = 12080,
		
		枪出如龙焚城印,
		
		枪出如龙斩将印,
		
		枪出如龙雷殛印,
		
		御龙晶甲无铭文 = 12090,
		
		御龙晶甲长磐印,
		
		御龙晶甲龙胆印,
		
		御龙晶甲吞虎印,
		
		凌云枪法无铭文 = 12100,
		
		凌云枪法撼地印,
		
		凌云枪法乱阵印,
		
		燃血化元无铭文 = 12110,
		
		燃血化元龙元印,
		
		燃血化元传薪印,
		
		燃血化元无双印,
		
		召唤龙驹无铭文 = 12120,
		
		召唤龙驹破军印,
		
		召唤龙驹救主印,
		
		盘龙枪势无铭文 = 12130,
		
		盘龙枪势金甲印,
		
		盘龙枪势虎痴印,
		
		盘龙枪势辟邪印,
		
		百战军魂无铭文 = 12140,
		
		百战军魂鏖战印,
		
		百战军魂血爆印,
		
		百战军魂千军印
	}
}
